Revit 2027 API
Category.Material Property
 Retrieves or changes the material of the category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Material Material { get; set; }
Public Property Material As Material
	Get
	Set
public:
property Material^ Material {
	Material^ get ();
	void set (Material^ value);
}
member Material : Material with get, set
Property Value
Material
null if this category does not have a material.
Exceptions
Exception | Condition
InvalidOperationException | When setting this property: material cannot be set for annotation categories.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace